class RunningEnviroments:
    PRODUCTION = "PROD"
    DEVELOPMENT = "DEV"

class AdminConsts:
    FILES = "فایل ها"
    NEW_FILE = "➕ فایل جدید"
    START_FILES_SECTION = """
    بخش فایل ها 🗃

با استفاده از این بخش ، میتوانید فایل هایی تعریف کنید (در قالب پیام تلگرامی) و این فایل ها برای کاربران قابل دریافت است .
میتوانید برای هر فایل ، عنوان و متن نمایشی دکمه اش را تعین کنید .
همچنین میتوانید فایلی را حذف کنید تا دیگر نمایش داده نشود .

📌 از منوی زیر استفاده کنید ...
    """
    SEND_YOUR_FILE = "لطفا فایل/پیغام خود را در قالب یک پیام ارسال کنید یا روی دکمه انصراف بزنید ..."
    REFERENCE_CHANNEL = "-1002031947877"
    START_ADMIN = "برای ورود به پنل ادمین رمز را وارد کنید 📡"
    PASSWORD = "12345"
    INVALID_PASSWORD = "رمز عبور صحیح نیست 🚫"
    ENTER_ADMIN_PANNEL = "✅ به پنل ادمین خوش آمدید ... گزینه مورد نظر را انتخاب کنید"
    ALL_REGISTERED_USERS_EXCEL = "گزارش ثبت نامی ها 📊"
    SEND_AD = "پیام همگانی"
    START_SEND_AD = """
    پیام خود را ارسال کنید،
   میتوانید آن را ویرایش کنید.
    برای ارسال همگانی، کافیست آن را ریپلای کرده و کلمه "ارسال" را تایپ کنید .

    در صورت انصراف ، کلمه بازگشت را تایپ کنید .
    """
    BACK_TO_ADMIN_MENU = "منوی ادمین ، گزینه مورد نظر را انتخاب کنید"
    EXIT = "خروج"
    SEND = "ارسال"
    REMIND_SEND = 'برای ارسال همگانی پیامتان را ریپلای کنید و کلمه ارسال را تایپ کنید.'
    ADD_BTN = "دکمه"
    CHOOSE_BTN_FORMAT = 'لطفا نوع دکمه ی مورد نظر را انتخاب کنید ...'
    LINK_BTN = 'لینکی'
    WEB_APP_BTN = 'وب اپی'
    SEND_YOUR_LINK = 'لطفا لینک مورد نظر خود را ارسال کنید ...'
    SEND_BTN_TITLE = 'لطفا متنی که در عنوان دکمه قرار میگیرد را وارد کنید ...'
    CHECK_FINAL_MSG_AND_SEND_IT = "لطفا بررسی کنید و از منوی پائین انتخاب کنید ..."
    SEND_TO_ALL = 'ارسال به همه'
    BACK = "بازگشت"
    FILE_PRIMARILY_SAVED_ENTER_BTN_TEXT = """
    فایل با موفقیت ثبت اولیه شد ✔️
    لطفا متن دکمه ای که میخواهید برای این فایل قرار بگیرد را ارسال کنید تا ثبت نهایی شود ...
    """
    FINALLY_SAVED_FILE = "فایل با موفقیت ثبت نهایی شد و از منوی فایل ها ، گزینه \"فایل های موجود 🗂\" قابل مشاهده است ."
    SEE_ALL_FILES = "تمامی فایل ها"
    SELECT_FILE_YOU_WANT = "فایل مورد نظر را جهت مشاهده یا حذف کردن انتخاب کنید یا بازگشت را بزنید ..."



class UserConsts:
    MSG_ON_START_WITH_NO_USER_DATA = """
    سلام دوست عزیزم 🪴 به ربات ارزشمند خوش اومدی ❤️
برای استفاده کامل از امکانات ربات ، باید اطلاعات کاربریتو کامل کنی .
    """
    MSG_ON_START = """
    منوی اصلی 📔 گزینه مورد نظرتو انتخاب کن
    """
    MY_USER_DATA_BTN = "اطلاعات کاربری من 👤"
    MY_USER_DATA_WHEN_NOT_COMPLETED_BTN = "🔴 اطلاعات کاربری من 🔴"
    ASK_NAME = "اسم قشنگت چیه 🖍 ؟"
    ASK_GRADE = """
    کلاس چندمی 😇 ؟ انتخاب کن :
(بعدا میتونی از قسمت اطلاعات کاربری پایه ت رو ویرایش کنی)
    """
    ASK_MAJOR = """
    چه رشته ای هستی 👓 ؟ انتخاب کن :
(بعدا میتونی از قسمت اطلاعات کاربری رشته ت رو ویرایش کنی)
    """
    ASK_PHONE_NUMBER = """
    شماره موبایلت رو بفرست تا کد تائید رو برات پیامک کنیم 📲
    """
    FULLNAME_TOO_LONG = """
    ❌ طول اسمی که وارد کردی خیلی زیاده ! یادت باشه که حداکثر 50 کاراکتر میتونی وارد کنی . دوباره اسمتو بفرست ...
    """
    FULLNAME_SAVED_MSG = "{} اسمت با موفقیت ذخیره شد !"
    INVALID_ENTERED_PHONE_NUMBER = """
    ❌ شماره معتبر نیست !
یادت باشه شماره تلفن باید دقیقا 11 رقم باشه و با 09 شروع بشه . دوباره شماره ت رو بفرست ...
    """
    VERIFICATION_CODE_IS_SENT = """
    کد تائید رو به {} پیامک کردیم 🌐
کد دریافتیت رو برامون بفرست ...
"""
    INVALID_MSG_ON_MAIN_MENU = """
    نفهمیدم چی گفتی 😵‍💫
    """
    MY_USER_DATA = """
    خب 🤓 اینم از اطلاعات کاربریت 👤 :

🪅 نام : {}
🪅 پایه : {}
🪅 رشته : {}
    """
    MY_USER_DATA_WITHOUT_MAJOR = """
    خب 🤓 اینم از اطلاعات کاربریت 👤 :

🪅 نام : {}
🪅 پایه : {}
    """
    JOIN_REQUEST_WELCOME_MSG = """
    {} عزیز سلام ❤️

🥳 فقط خواستیم ورودت رو به کانال گروه آموزشی مند تبریک بگیم !

🤩 خبرای داغی تو راهه و به زودی اتفاقات خیلی خوبی توی این ربات قراره بیوفته ... استارت رو بزن که جا نمونی 🔥
    """
    FILES_SECTION = "فایل ها 🤩"
    ENTER_FILES_SECTION = """
    {} عزیزم به قسمت فایل ها خوش اومدی 🗂 هرکدوم از فایل ها رو که میخوای انتخاب کن تا برات بفرستمش 😜
    """
    THIS_FILE_IS_DELETED = "متاسفانه این فایل حذف شده ☹️ یه فایل دبگه انتخاب کن ..."










